Configuration_correct/Диплом_correct/src/Documents/ВКМ_НачислениеФиксированныхПремий/ВКМ_НачислениеФиксированныхПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированныхПремий</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration_correct/Диплом_correct/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration_correct/Диплом_correct/src/Documents/ВКМ_НачислениеФиксированныхПремий/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	//Замечание 3. В документах расчета заработной платы НДФЛ рассчитывается вместе с начислениями. 
	//Необходимо рассчитывать отдельно с использованием механизма базы регистров расчета.
	СформироватьДвиженияПоФиксированнойПремии();
	РассчитатьНДФЛ();
	Взаиморасчеты();  
КонецПроцедуры 

Процедура СформироватьДвиженияПоФиксированнойПремии()
	Для Каждого Строка Из СписокСотрудников Цикл
		ДвижениеФиксированнаяПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеФиксированнаяПремия.ПериодРегистрации = Дата;
		ДвижениеФиксированнаяПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		ДвижениеФиксированнаяПремия.БазовыйПериодНачало = Дата;    
		ДвижениеФиксированнаяПремия.БазовыйПериодКонец = Дата;  		
		ДвижениеФиксированнаяПремия.Сотрудник = Строка.Сотрудник;   
		ДвижениеФиксированнаяПремия.Результат = Строка.СуммаПремии;
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();  
КонецПроцедуры

Процедура РассчитатьНДФЛ()

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                |	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	                |	ВКМ_ДополнительныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	                |	ВКМ_ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	                |	ВКМ_ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	                |	ОКР(ВКМ_ДополнительныеНачисления.Результат * 13 / 100, 2) КАК Результат,
	                |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	                |	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
	                |ИЗ
	                |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	                |ГДЕ
	                |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи =  РезультатЗапроса.Выбрать();  
	//ВыборкаДетальныеЗаписиТЗ =  РезультатЗапроса.Выгрузить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = ВыборкаДетальныеЗаписи.ПериодРегистрации;
		ДвижениеНДФЛ.БазовыйПериодНачало = ВыборкаДетальныеЗаписи.БазовыйПериодНачало;    
		ДвижениеНДФЛ.БазовыйПериодКонец = ВыборкаДетальныеЗаписи.БазовыйПериодКонец;  		
		ДвижениеНДФЛ.Результат = ВыборкаДетальныеЗаписи.Результат;	
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеНДФЛ.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДвижениеНДФЛ.БазаВидРасчета = ВыборкаДетальныеЗаписи.ВидРасчета;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

Процедура Взаиморасчеты()   
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаСотрудникиТЗ =  Запрос.Выполнить().Выгрузить(); 

	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	               |	СУММА(ВКМ_Удержания.Результат) КАК Удержания
	               |ПОМЕСТИТЬ ВТ_Удержания
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_Удержания.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Результат
	               |ПОМЕСТИТЬ ВТ_ДопНачисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ДополнительныеНачисления.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВыборкаСотрудники.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_Сотрудники
	               |ИЗ
	               |	&ВыборкаСотрудники КАК ВыборкаСотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Удержания.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(ВТ_Удержания.Удержания, 0) КАК Удержания,
	               |	ЕСТЬNULL(ВТ_ДопНачисления.Результат, 0) КАК ДопНачисления
	               |ИЗ
	               |	ВТ_Сотрудники КАК ВТ_Сотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
	               |		ПО ВТ_Сотрудники.Сотрудник = ВТ_Удержания.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопНачисления КАК ВТ_ДопНачисления
	               |		ПО ВТ_Сотрудники.Сотрудник = ВТ_ДопНачисления.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВыборкаСотрудники", ВыборкаСотрудникиТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи =  РезультатЗапроса.Выбрать();  
	//ВыборкаДетальныеЗаписиТЗ =  РезультатЗапроса.Выгрузить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;   
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.ДопНачисления - ВыборкаДетальныеЗаписи.Удержания;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
	КонецЦикла;
	//Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры
	

#КонецОбласти

#КонецЕсли
